In [1]:
from pandas import Series, DataFrame
import numpy as np
import pandas as pd

In [2]:
from numpy import nan as NA

In [3]:
data=Series([1,NA,3.5,NA,7])

In [4]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [5]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data=DataFrame([[1,2,3],[1,NA,3],[NA,NA,NA],[NA,2,NA]])

In [7]:
data

     0    1    2
0  1.0  2.0  3.0
1  1.0  NaN  3.0
2  NaN  NaN  NaN
3  NaN  2.0  NaN

In [9]:
cleaned=data.dropna()

In [10]:
cleaned

     0    1    2
0  1.0  2.0  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  1.0  NaN  3.0
3  NaN  2.0  NaN

In [12]:
data[4]=NA

In [13]:
data

     0    1    2   4
0  1.0  2.0  3.0 NaN
1  1.0  NaN  3.0 NaN
2  NaN  NaN  NaN NaN
3  NaN  2.0  NaN NaN

In [15]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  2.0  3.0
1  1.0  NaN  3.0
2  NaN  NaN  NaN
3  NaN  2.0  NaN

In [16]:
df=DataFrame(np.random.randn(7,3))
df

          0         1         2
0  0.153066  0.701470  1.189384
1 -0.234959 -0.545407  0.368169
2 -0.305410  0.064099  0.140661
3 -0.638269  1.680550  0.644455
4  1.085733 -0.164909 -1.075183
5  0.998488  0.771905  0.893800
6  0.103012 -1.385587  0.220398

In [17]:
df.ix[:4,1]=NA; df.ix[:2,2]=NA

In [18]:
df

          0         1         2
0  0.153066       NaN       NaN
1 -0.234959       NaN       NaN
2 -0.305410       NaN       NaN
3 -0.638269       NaN  0.644455
4  1.085733       NaN -1.075183
5  0.998488  0.771905  0.893800
6  0.103012 -1.385587  0.220398

In [21]:
df.dropna(thresh=3)

          0         1         2
5  0.998488  0.771905  0.893800
6  0.103012 -1.385587  0.220398

In [22]:
#Filling in missing data

In [23]:
df.fillna(0)

          0         1         2
0  0.153066  0.000000  0.000000
1 -0.234959  0.000000  0.000000
2 -0.305410  0.000000  0.000000
3 -0.638269  0.000000  0.644455
4  1.085733  0.000000 -1.075183
5  0.998488  0.771905  0.893800
6  0.103012 -1.385587  0.220398

In [25]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.153066  0.500000       NaN
1 -0.234959  0.500000       NaN
2 -0.305410  0.500000       NaN
3 -0.638269  0.500000  0.644455
4  1.085733  0.500000 -1.075183
5  0.998488  0.771905  0.893800
6  0.103012 -1.385587  0.220398

In [26]:
df.fillna(0, inplace=True)

In [27]:
df

          0         1         2
0  0.153066  0.000000  0.000000
1 -0.234959  0.000000  0.000000
2 -0.305410  0.000000  0.000000
3 -0.638269  0.000000  0.644455
4  1.085733  0.000000 -1.075183
5  0.998488  0.771905  0.893800
6  0.103012 -1.385587  0.220398

In [28]:
df=DataFrame(np.random.randn(6,3))
df

          0         1         2
0  1.790627 -1.175441 -0.692376
1 -0.782117  0.813289  1.858439
2 -1.094929  0.358214 -0.406493
3 -0.667912  0.570723 -1.240928
4  1.148212 -0.139368  1.346891
5  0.178771  0.240376 -2.341499

In [29]:
df.ix[2:,1]=NA; df.ix[4:,2]=NA

In [30]:
df

          0         1         2
0  1.790627 -1.175441 -0.692376
1 -0.782117  0.813289  1.858439
2 -1.094929       NaN -0.406493
3 -0.667912       NaN -1.240928
4  1.148212       NaN       NaN
5  0.178771       NaN       NaN

In [31]:
df.fillna(method='ffill')

          0         1         2
0  1.790627 -1.175441 -0.692376
1 -0.782117  0.813289  1.858439
2 -1.094929  0.813289 -0.406493
3 -0.667912  0.813289 -1.240928
4  1.148212  0.813289 -1.240928
5  0.178771  0.813289 -1.240928

In [32]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.790627 -1.175441 -0.692376
1 -0.782117  0.813289  1.858439
2 -1.094929  0.813289 -0.406493
3 -0.667912  0.813289 -1.240928
4  1.148212       NaN -1.240928
5  0.178771       NaN -1.240928

In [34]:
#Hierarchical indexing
data=Series(np.random.randn(10),
            index=[list('aaabbbccdd'), [1,2,3,1,2,3,1,2,2,3]])

In [35]:
data

a  1    0.941721
   2    1.352791
   3    0.534377
b  1    1.258508
   2    1.329079
   3    1.537751
c  1   -0.280898
   2    0.341996
d  2    2.080725
   3    0.219691
dtype: float64

In [36]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [38]:
data['b':'c']

b  1    1.258508
   2    1.329079
   3    1.537751
c  1   -0.280898
   2    0.341996
dtype: float64

In [39]:
data[['b','d']]

b  1    1.258508
   2    1.329079
   3    1.537751
d  2    2.080725
   3    0.219691
dtype: float64

In [40]:
data.unstack()

          1         2         3
a  0.941721  1.352791  0.534377
b  1.258508  1.329079  1.537751
c -0.280898  0.341996       NaN
d       NaN  2.080725  0.219691

In [41]:
data.unstack().stack()

a  1    0.941721
   2    1.352791
   3    0.534377
b  1    1.258508
   2    1.329079
   3    1.537751
c  1   -0.280898
   2    0.341996
d  2    2.080725
   3    0.219691
dtype: float64

In [42]:
df=DataFrame(np.arange(12).reshape((4,3)),
             index=[list('aabb'),[1,2,1,2]],
             columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
df

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [43]:
df.index.names=['key1','key2']

In [44]:
df.columns.names=['state','colour']

In [45]:
df

state      Ohio     Colorado
colour    Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [46]:
df.swaplevel('key1','key2')

state      Ohio     Colorado
colour    Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [50]:
df.sortlevel(1)

state      Ohio     Colorado
colour    Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [51]:
df.swaplevel(0,1).sortlevel(0)

state      Ohio     Colorado
colour    Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [53]:
df.sum(level='key2')

state   Ohio     Colorado
colour Green Red    Green
key2
1          6   8       10
2         12  14       16

In [55]:
df.sum(level='colour', axis=1)

colour     Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [56]:
frame=DataFrame({'a': range(7), 'b': range(7,0,-1), 'c': ['one','one','one','two','two','two','two'], 'd': [1,0,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  1
1  1  6  one  0
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3